quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100.C
/*******************************************************************************
* 函数名			:	sdq_write_bit
* 功能描述		:	1-wire 一位（1bit）写操作-写0&写1：写操作整体时序需要60-120us，写完后需要最少1us等待时间。
							写操作时从设备采样在总线拉低后15-60us进行采样，写时序需要在总线拉低后15us内设置总线是写1还是写0（高电平写1，低电平写0）。

							向1-Wire总线写1bit至少需要60μs，同时还要保证两次连续的写操作有1μs 以上的间隔。
							若待写位wbit为0则主机拉低总线60μs然后释放，写0操作完成。
							若待写位wbit为1，则主机拉低总线并在1～15μs内释放，然后等待60μs，写1操作完成。
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void sdq_write_bit(unsigned char bit)		//1-wire 一位（1bit）写操作-写0&写1
{
	//总时间按80us
	// =============Write 1
	if (bit&0x01)		
	{
		SDQ_L;					//拉低总线
		SysTick_DeleyuS(10);		//至少维持了1us,表示写时序(包括写0时序或写1时序)开始 
		SDQ_H;					//拉高总线
		SysTick_DeleyuS(80);	//等待从机采样完成
	}
	// =============Write 0
	else						
	{
		SDQ_L;					//拉低总线
		SysTick_DeleyuS(85);	//保持60us，等待从机采样
		SDQ_H;					//释放总线
		SysTick_DeleyuS(5);
	}
	SysTick_DeleyuS(2);
}
/*******************************************************************************
* 函数名			:	sdq_read_bit
* 功能描述		:	从Dallas读取一个位	- 读0&读1
							读时序最少需要拉低总线1us，然后释放总线，从设备会在15-45us操作总线，主机进行采样。
							两次之间最少需要1us的时间间隔。
							从1-Wire总线读取1bit同样至少需要60μs，同时也要保证两次连续的读操作间隔1μs以上
* 输入			: void
* 返回值			: 1/0
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
unsigned char sdq_read_bit(void)
{
	//总时间按80us
	unsigned char bit=0;	
	SDQ_SetOut;				//设为输出模式
	SDQ_L; 						//拉低总线
	//SysTick_DeleyuS(15);		//至少1us时间
//	SDQ_H; 						//释放总线
	SDQ_SetIn;					//设置为输入模式
	//SDQ_H; 						//释放总线
	SysTick_DeleyuS(15);	//等待从机响应

	if(0!=SDQ_Read)				//读取总线状态
		bit = 1;
	else
		bit = 0;	
	SysTick_DeleyuS(60);
	return bit;
}
//------------------------------------------------------------------------------



/*******************************************************************************
* 函数名			:	function
* 功能描述		:	写一个字节到Dallas---从低位开始写入
* 输入			: dat：要写入的字节,
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void sdq_write_byte(unsigned char dat)
{             
	unsigned char j;
	unsigned char testb;
	
	SDQ_SetOut;							//SET PG11 OUTPUT;
	
	for (j=1; j<=8; j++)
	{
		testb = dat&0x01;
		dat = dat>>1;
		sdq_write_bit(testb);		//1-wire 一位（1bit）写操作-写0&写1
	}
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	从Dallas读取一个字节---从低位开始读取
* 输入			: void
* 返回值			: 读到的数据
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
unsigned char sdq_read_byte(void)
{        
	unsigned char i,j,dat;
	SDQ_SetIn;
	dat = 0;
	for (i=1; i<=8; i++)
	{
		j = sdq_read_bit();		//读取一位数据
		dat = (j<<7)|(dat>>1);	//从低位开始保存数据
	}	
	return dat;
}
//------------------------------------------------------------------------------



//------------------------------------------------------------------------------
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	复位Dallas--拉低总线(低速480uS,高速48uS),然后释放总线，等待从机拉高总线
* 输入			: void
* 返回值			: 返回0:复位不成功/无IC
							返回1:复位成功
*******************************************************************************/
sdq_result bq26100_rest(void)		//复位Dallas,返回结果
{
	unsigned short retry=0;
	//----------------------复位时间：拉低信号大于480us
	SDQ_H;
	SDQ_SetOut;							//SET PG11 OUTPUT
	SDQ_H;
	SysTick_DeleyuS(10);		//拉低750us（大于480uS)
	SDQ_L;									//拉低DQ
	SysTick_DeleyuS(750);		//拉低750us（大于480uS)
//	SDQ_H;								//DQ=1 
//	SysTick_DeleyuS(15);		//15US---检测响应需要在15uS后
	
	//----------------------检测响应：总时间需要大于480us
	//1释放总线
	//2等待15us~60uS
	//3从机拉低总线60uS~240uS
	//4从机释放/拉高总线
	SDQ_SetIn;				//SET PG11 INPUT		//输入模式
	SysTick_DeleyuS(15);		//15US---检测响应需要在15uS后
	while(SDQ_Read	&& (retry < 260))			//响应检测时间不超过240uS
	{
		retry++;
		SysTick_DeleyuS(1);
	}
	if(retry >= 250)	//超时
		return sdq_error;
	else
		retry=0;
	//增加延时--为了满足总的检测时间480uS
	SysTick_DeleyuS(480);		//总的检测响应时间需要大于480uS
	return sdq_success;
}
//------------------------------------------------------------------------------



//------------------------------------------------------------------------------



/**********************************************************************/
/* 	unsigned char TestPresence(void)							      */
/*																      */
/*	Description : 		Detects if a device responds to Reset signal  */
/* 	Arguments : 		PresenceTimer - Sets timeout if no device	  */
/*							present									  */
/*						InputData - Actual state of GPIO			  */
/*						GotPulse - States if a pulse was detected	  */
/*	Global Variables:	None   										  */
/*  Returns: 			GotPulse         							  */
/**********************************************************************/
unsigned char TestPresence(void)
{
	unsigned int PresenceTimer;
	static volatile unsigned char InputData;
	static volatile unsigned char GotPulse;

	SDQ_SetIn;		//Set GPIO P9.3 as Input
	PresenceTimer = 300;	//Set timeout, enough time to allow presence pulse
	GotPulse = 0;			//Initialize as no pulse detected
	while ((PresenceTimer > 0) && (GotPulse == 0))
	{
		InputData = SDQ_Read;	//Monitor logic state of GPIO 
		if (InputData == 0) 
		{  		//If GPIO is Low,
			GotPulse = 1;			//it means that device responded
		}
		else 
		{						//If GPIO is high
			GotPulse = 0;			//it means that device has not responded
			--PresenceTimer;		//Decrease timeout until enough time has been allowed for response
		}
	}
	SysTick_DeleyuS(200);					//Wait some time to continue SDQ communication
	return GotPulse;				//Return if device detected or not
}
//--------------------------------------------------------------------------







/**********************************************************************/
//*	unsigned long Rotl(unsigned long x, int n)
//*																      
//*	Description : 		This procedure is a rotate left n spaces of	32-bit word x.
//*	Arguments : 		x - word to be rotated n - amount of spaces to rotated to the left
//*	Global Variables:	None
//*	Returns: 			Result of 32-bit word rotated n times
/**********************************************************************/
unsigned long Rotl(unsigned long x, int n)
{
	return (x<<n) |  (x>>(32-n));
}
unsigned long rRotl(unsigned long x, int n)
{
	return (x>>n) |  (x<<(32-n));
}
/**********************************************************************/
//* 	unsigned long W(int t)
//*	Description : 		This procedure determines the work schedule for W(16) through W(79)
//* 	Arguments : 		t - index of work schedule 16 through 79
//*	Global Variables:	Ws[]
//*  Returns: 			Work schedule value with index t
/**********************************************************************/
unsigned long W(int t)
{
	return Rotl(Ws[t-3] ^ Ws[t-8] ^ Ws[t-14] ^ Ws[t-16], 1);
}	

/**********************************************************************/
//*	unsigned long K(int t)
//*																      */
//*	Description : 		This procedure selects one of the K values depending on the index t.
//*	Arguments : 		t - index 
//*	Global Variables:	None
//*	Returns: 			One of the 4 K values
/**********************************************************************/
unsigned long K(int t)
{
	if (t<=19)
		return 0x5a827999;
	else if (t>=20 && t<=39)
		return 0x6ed9eba1;
	else if (t>=40 && t<=59)
		return 0x8f1bbcdc;
	else if (t>=60 && t<=79)
		return 0xca62c1d6;
	else
		return 0;		//Invalid value, not expected
}
	
