quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100.C
/*******************************************************************************/
//*	unsigned long f(unsigned long x, unsigned long y, unsigned long z, int t)
//*																               */
//*	Description : 		This procedure selects the ft(b,c,d) function based on SLUA389 and FIPS 180-2 document.
//*	Arguments : 	x - b as seen in document 
//*								y - c as seen in document
//*             	z - d as seed in document
//*              	t - index
//*	Global Variables:	None
//*	Returns: 			Result of ft function
/*******************************************************************************/
unsigned long f(u32 x, u32 y, u32 z, int t)
{
	if (t<=19)
		return (x & y) ^ ((~x) & z);
	else if (t>=20 && t<=39)
		return x ^ y ^ z;
	else if (t>=40 && t<=59)
		return (x & y) ^ (x & z) ^ (y & z);
	else if (t>=60 && t<=79)
		return x ^ y ^ z;
	else
		return 0;       //Invalid value, not expected
}
//-----------------------------------------------------------------------------



/*******************************************************************************
*函数名			:	api_bq26100_step1_Auth
*功能描述		:	本程序按照BQ26100的要求计算SHA1/HMAC
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
* 	void Auth(void)
*														
*	Description : 		This procedure computes the SHA1/HMAC as
*				  		required by the bq26100
* 	Arguments : 		i - times that SHA1 is executing			 
*						t - index 0 through 79
*     					temp - Used to update working variables
*	Global Variables:	Random[], Message[], Key[], Ws[], H[],
*						A, B, C, D, E	
*  Returns: 			Result of 32-bit word rotated n times
*******************************************************************************/
void api_bq26100_step1_Auth(void)
{
	int i;			//Used for doing two times the SHA1 as required by the bq26100
	int t;			//Used for the indexes 0 through 79
	u32 temp;		//Used as the temp variable during the loop in which the working
							//variables A, B, C, D and E are updated
	
	// The 20 bytes of random message that are given to the bq26100 are arranged in 32-bit words
	// so that the microcontroller can compute the SHA1/HMAC
	Random[0] = Message[0x10] + Message[0x11]*0x0100 + Message[0x12]*0x010000 + Message[0x13]*0x01000000;
	Random[1] = Message[0x0C] + Message[0x0D]*0x0100 + Message[0x0E]*0x010000 + Message[0x0F]*0x01000000;
	Random[2] = Message[0x08] + Message[0x09]*0x0100 + Message[0x0A]*0x010000 + Message[0x0B]*0x01000000;
	Random[3] = Message[0x04] + Message[0x05]*0x0100 + Message[0x06]*0x010000 + Message[0x07]*0x01000000;
	Random[4] = Message[0x00] + Message[0x01]*0x0100 + Message[0x02]*0x010000 + Message[0x03]*0x01000000;
	// The SHA1 is computed two times so that it complies with the bq26100 specification
	for (i=0; i<=1; i++)	//转换两次
	{
		//-------------------加载密钥
		// Work Schedule
		// The first four Working schedule variables Ws[0-3], are based on the key that is 
		// implied that the bq26100 contains.
		Ws[0] = Key[0x0C] + Key[0x0D]*0x0100 + Key[0x0E]*0x010000 + Key[0x0F]*0x01000000;
		Ws[1] = Key[0x08] + Key[0x09]*0x0100 + Key[0x0A]*0x010000 + Key[0x0B]*0x01000000;
		Ws[2] = Key[0x04] + Key[0x05]*0x0100 + Key[0x06]*0x010000 + Key[0x07]*0x01000000;
		Ws[3] = Key[0x00] + Key[0x01]*0x0100 + Key[0x02]*0x010000 + Key[0x03]*0x01000000;
		//-------------------第一次转换加载消息，第二将转换加载第一次转换的消息摘要
		// On the first run of the SHA1 the random message is used 		
		if (i==0)
		{
			Ws[4] = Random[0];
			Ws[5] = Random[1];
			Ws[6] = Random[2];
			Ws[7] = Random[3];
			Ws[8] = Random[4];
		}
		// On the second run of the SHA1, H(Kd || M) is used		
		else
		{
			Ws[4] = H[0];
			Ws[5] = H[1];
			Ws[6] = H[2];
			Ws[7] = H[3];
			Ws[8] = H[4];
		}
		//-------------------补位操作:
		//Sha-1算法标准规定，必须对消息摘要进行补位操作，即将输入的数据进行填充，使得数据长度对512求余的结果为448，
		//填充比特位的最高位补一个1，其余的位补0，如果在补位之前已经满足对512取模余数为448，也要进行补位，在其后补一位1即可。总之，补位是至少补一位，最多补512位
		// The Work schedule variables Ws[9-15] remain the same regardless of which run of the SHA1.
		// These values are as required by bq26100.	//以下为按照bq26100规定的数值
		Ws[9]	= 0x80000000;		//输入消息长度对512取模余数结果非448(512-64)
		Ws[10] = 0x00000000;
		Ws[11] = 0x00000000;
		Ws[12] = 0x00000000;
		Ws[13] = 0x00000000;
		//--------------------附加信息长度(64位):表示消息摘要的字节数，
		Ws[14] = 0x00000000;
		Ws[15] = 0x00000120;		//总共长度为0x0120(288=160+128)密钥和消息的长度
		
		//--------------------补充混合数据
		// The Work schedule variables Ws[16-79] are determined by the W(t) function	
		for (t = 16; t <= 79; t++)
			Ws[t]=W(t);
		//--------------------初始化缓存
		//一个160位MD缓冲区用以保存中间和最终散列函数的结果。它可以表示为5个32位的寄存器(H0,H1,H2,H3,H4)。初始化为：
		// Working Variables, always start the same	regardless of which SHA1 run
		A = 0x67452301;
		B = 0xefcdab89;
		C = 0x98badcfe;
		D = 0x10325476;
		E = 0xc3d2e1f0;
		// Hash Values, always start the same regardless of what SHA1 run
		H[0] = A;
		H[1] = B;
		H[2] = C;
		H[3] = D;
		H[4] = E;
		//---------------------循环转换数据
		// Loop to change working variables A, B, C, D and E
		// This is defined by FIPS 180-2 document
		for (t = 0; t <= 79; t++)
		{
				temp = Rotl(A,5) + f(B,C,D,t) + E + K(t) + Ws[t];
				E = D;
				D = C;
				C = Rotl(B,30);
				B = A;
				A = temp;
		}
		//----------------------转换出验证结果:转换再次，第一次结果参当作第二次转换的数据
		// 160-Bit SHA-1 Digest
		H[0] = A + H[0];
		H[1] = B + H[1];
		H[2] = C + H[2];
		H[3] = D + H[3];
		H[4] = E + H[4];
	}//End of for loop
}	//End Auth() function
/*******************************************************************************
*函数名			:	api_bq26100_step2_send_message
*功能描述		:	Send 160-bit Message to bq26100
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
sdq_result api_bq26100_step2_send_message(unsigned char* message,unsigned char len)
{
	unsigned long i = 0;
	unsigned char Value	=	0;
	sdq_result result;
	// Send 160-bit Message to bq26100
	result	=	bq26100_rest();
	if(sdq_error	==	result)
		return sdq_error;
	// Skip ROM Command
	sdq_write_byte(0xCC);
	// Write Message Command
	sdq_write_byte(0x22);	//Write Message Command
	// Write Address
	//bq26100_reg_addr
	sdq_write_byte(bq26100_reg_addr&0xFF);	//Address Low Byte
	sdq_write_byte((bq26100_reg_addr>>8)&0xFF);	//Address High Byte
	// Write first byte of message, Message[0]
	sdq_write_byte(Message[0x00]);	
	Value	=	sdq_read_byte();	//Read CRC of Message Command, Address and Data
	//CRC are not being calculated by the microcontroller, the results given by
	//bq26100 are being ignored
	// Read Data to Verify Write
	Value	=	sdq_read_byte();
	// Write the remaining bytes of the message
	for (i=1; i<=19; i++)
	{
		sdq_write_byte(Message[i]);
		Value	=	sdq_read_byte();		//Read CRC of Message Command, Address and Data
																//CRC are not being calculated by the microcontroller, the results given by
																//bq26100 are being ignored
		Value	=	sdq_read_byte();		// Read Data to Verify Write
		
