quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100.C
	}
	return sdq_success;
}
/*******************************************************************************
*函数名			:	api_bq26100_step3_write_control
*功能描述		:	Write Control to set AUTH bit to initiate Authentication by bq26100
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
sdq_result api_bq26100_step3_write_control(void)
{
	unsigned char Value	=	0;
	sdq_result result;
	// Write Control to set AUTH bit to initiate Authentication by bq26100
	result	=	bq26100_rest();
	if(sdq_error	==	result)
		return sdq_error;
	//Value = TestPresence();
	// Skip ROM Command
	sdq_write_byte(0xCC);
	// Write Control Command
	sdq_write_byte(sdq_mem_write_control);	//Write Control Command
	//bq26100_reg_addr
//	sdq_write_byte(bq26100_reg_addr&0xFF);	//Address Low Byte
//	sdq_write_byte((bq26100_reg_addr>>8)&0xFF);	//Address High Byte
	sdq_write_byte(0x00);	//Address Low Byte
	sdq_write_byte(0x00);	//Address High Byte	
	sdq_write_byte(0x05);			// Write Auth Bit of Control Register
	Value = sdq_read_byte();	//Read CRC of Write Control Command, Address and Data
	// Read Data to Verify Write
	Value = sdq_read_byte();
	
	//sdq_write_byte(0x01);	//Address Low Byte
	//sdq_write_byte(0x00);	//Address High Byte
	sdq_write_byte(0xA1);			// Write Auth Bit of Control Register
	Value = sdq_read_byte();	//Read CRC of Write Control Command, Address and Data	
	Value = sdq_read_byte();	// Read Data to Verify Write
	return sdq_success;
}
/*******************************************************************************
*函数名			:	api_bq26100_step3_write_control
*功能描述		:	Write Control to set AUTH bit to initiate Authentication by bq26100
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
sdq_result api_bq26100_step4_read_control(void)
{
	unsigned char Value	=	0;
	sdq_result result;
	// Write Control to set AUTH bit to initiate Authentication by bq26100
	result	=	bq26100_rest();
	if(sdq_error	==	result)
		return sdq_error;
	//Value = TestPresence();
	// Skip ROM Command
	sdq_write_byte(0xCC);
	// Write Control Command
	sdq_write_byte(sdq_mem_read_control);	//Write Control Command
	//bq26100_reg_addr
//	sdq_write_byte(bq26100_reg_addr&0xFF);	//Address Low Byte
//	sdq_write_byte((bq26100_reg_addr>>8)&0xFF);	//Address High Byte
	sdq_write_byte(0x00);	//Address Low Byte
	sdq_write_byte(0x00);	//Address High Byte	
	Value = sdq_read_byte();	//Read CRC of Write Control Command, Address and Data
	Value = sdq_read_byte();
	sdq_write_byte(0xA1);	
	Value = sdq_read_byte();	//Read CRC of Write Control Command, Address and Data	
	return sdq_success;
}
/*******************************************************************************
*函数名			:	api_bq26100_step5_read_digest
*功能描述		:	Read Digest
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
sdq_result api_bq26100_step5_read_digest(void)
{
	unsigned char i = 0;
	unsigned char Value	=	0;
	sdq_result result;
	//Read Digest
	result	=	bq26100_rest();
	if(sdq_error	==	result)
		return sdq_error;	
	//Value = TestPresence();
	// Skip ROM Command
	sdq_write_byte(0xCC);
	// Read Digest Command
	sdq_write_byte(0xDD);	//Read Digest Command
	// Write Address
	//bq26100_reg_addr
	sdq_write_byte(bq26100_reg_addr&0xFF);	//Address Low Byte
	sdq_write_byte((bq26100_reg_addr>>8)&0xFF);	//Address High Byte
	Value = sdq_read_byte();	//Read CRC of Read Digest Command, Address
	// Read Digest
	for (i=0; i<=19; i++)
	{
		Digest[i] = sdq_read_byte();
	}
	// Read CRC of Digest
	Value = sdq_read_byte();

	// The 20 bytes of the digest returned by the bq26100 is arranged in 32-bit words so that it
	// can be compared with the results computed by the microcontroller
	
	Digest_32[4] = Digest[0x00] + Digest[0x01]*0x0100 + Digest[0x02]*0x010000 + Digest[0x03]*0x01000000;
	Digest_32[3] = Digest[0x04] + Digest[0x05]*0x0100 + Digest[0x06]*0x010000 + Digest[0x07]*0x01000000;
	Digest_32[2] = Digest[0x08] + Digest[0x09]*0x0100 + Digest[0x0A]*0x010000 + Digest[0x0B]*0x01000000;
	Digest_32[1] = Digest[0x0C] + Digest[0x0D]*0x0100 + Digest[0x0E]*0x010000 + Digest[0x0F]*0x01000000;
	Digest_32[0] = Digest[0x10] + Digest[0x11]*0x0100 + Digest[0x12]*0x010000 + Digest[0x13]*0x01000000;
	if ((Digest_32[0] == H[0])&&(Digest_32[1] == H[1])&&(Digest_32[2] == H[2])&&(Digest_32[3] == H[3]))
	{

		//------------------------验证通过
	}

	return sdq_success;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void bq26100_set_key(void)
{
	// Select the key to be used here. In this example 0x3601FCFB12B87356C1548630FD3EA0D2 is used.  
	Key[0] = 0xD2;
	Key[1] = 0xA0;
	Key[2] = 0x3E;
	Key[3] = 0xFD;
	Key[4] = 0x30;
	Key[5] = 0x86;
	Key[6] = 0x54;
	Key[7] = 0xC1;
	Key[8] = 0x56;
	Key[9] = 0x73;
	Key[10] = 0xB8;
	Key[11] = 0x12;
	Key[12] = 0xFB;
	Key[13] = 0xFC;
	Key[14] = 0x01;
	Key[15] = 0x36;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void bq26100_set_message(void)
{
	unsigned char i = 0;
	static unsigned char data=0;
	//static unsigned char time=0;
	//-----------------------------随机数
	srand(0);
	for (i=0; i<=19; i++)
	{
		Message[i] = rand()%256;		//获取随机数
	}
	//-----------------------------上电启动:验证通过
	Message[0]	=	0xb8;
	Message[1]	=	0xd3;
	Message[2]	=	0xaa;
	Message[3]	=	0x20;
	Message[4]	=	0x82;
	Message[5]	=	0xfe;
	Message[6]	=	0xd1;
	Message[7]	=	0xf0;
	Message[8]	=	0x7c;
	Message[9]	=	0x0a;
	Message[10]	=	0x07;
	Message[11]	=	0x8e;
	Message[12]	=	0x26;
	Message[13]	=	0xc7;
	Message[14]	=	0xde;
	Message[15]	=	0x10;
	Message[16]	=	0xca;
	Message[17]	=	0xa3;
	Message[18]	=	0x2c;
	Message[19]	=	0xc8;
	
	
	

//-----------------------------逻辑分析仪007:验证通过
	Message[0]	=	0xFD;
	Message[1]	=	0xAB;
	Message[2]	=	0x14;
	Message[3]	=	0xB6;
	Message[4]	=	0xCE;
	Message[5]	=	0x0A;
	Message[6]	=	0x28;
	Message[7]	=	0x41;
	Message[8]	=	0x2F;
	Message[9]	=	0x08;
	Message[10]	=	0x6D;
	Message[11]	=	0xD4;
	Message[12]	=	0xDB;
	Message[13]	=	0x62;
	Message[14]	=	0x89;
	Message[15]	=	0xB0;
	Message[16]	=	0x77;
	Message[17]	=	0x30;
	Message[18]	=	0x59;
	Message[19]	=	0x5D;
	//-----------------------------逻辑分析仪001:验证通过
	//0xEC 0x8D 0x31 0x3B 0xCF 0xAD 0x8A 0x2E 0xAA 0xF9 0xAA 0x26 0xC1 0xFF  0xF1 0xD2 0x95 0x91 0xAA 0xEA 
	Message[0]	=	0xEC;
	Message[1]	=	0x8D;
	Message[2]	=	0x31;
	Message[3]	=	0x3B;
	Message[4]	=	0xCF;
	Message[5]	=	0xAD;
	Message[6]	=	0x8A;
	Message[7]	=	0x2E;
	Message[8]	=	0xAA;
	Message[9]	=	0xF9;
	Message[10]	=	0xAA;
	Message[11]	=	0x26;
	Message[12]	=	0xC1;
	Message[13]	=	0xFF;
	Message[14]	=	0xF1;
	Message[15]	=	0xD2;
	Message[16]	=	0x95;
	Message[17]	=	0x91;
	Message[18]	=	0xAA;
	Message[19]	=	0xEA;
	//-----------------------------逻辑分析仪002:
	//0x4D 0x9B 0x16 0x28 0x66 0x43 0xB9 0x85 0x9C 0x46 0xE2 0xB7 0x1A 0x91 0x7F 0xEA 0xE0 0x1C 0x21 0xBD
	Message[0]	=	0x4D;
	Message[1]	=	0x9B;
	Message[2]	=	0x16;
	Message[3]	=	0x28;
	Message[4]	=	0x66;
	Message[5]	=	0x43;
	Message[6]	=	0xB9;
	Message[7]	=	0x85;
	Message[8]	=	0x9C;
	Message[9]	=	0x46;
	Message[10]	=	0xE2;
	Message[11]	=	0xB7;
	Message[12]	=	0x1A;
	Message[13]	=	0x91;
	Message[14]	=	0x7F;
	Message[15]	=	0xEA;
	Message[16]	=	0xE0;
	Message[17]	=	0x1C;
	Message[18]	=	0x21;
	Message[19]	=	0xBD;
	
	//-----------------------------测试数据3:通过验证
	//83 b2 06 2e 21 60 79 00 f3 60 b0 f1 b7 2e 27 bc ff a7 e3 f1
	Message[0]	=	0x83;
	Message[1]	=	0xB2;
	Message[2]	=	0x06;
	Message[3]	=	0x2E;
	Message[4]	=	0x21;
	Message[5]	=	0x60;
	Message[6]	=	0x79;
	Message[7]	=	0x00;
	Message[8]	=	0xF3;
	Message[9]	=	0x60;
	Message[10]	=	0xB0;
	Message[11]	=	0xF1;
	Message[12]	=	0xB7;
	Message[13]	=	0x2E;
	Message[14]	=	0x27;
	Message[15]	=	0xBC;
	Message[16]	=	0xFF;
	Message[17]	=	0xA7;
	Message[18]	=	0xE3;
	Message[19]	=	0xF1;
	
	//-----------------------------测试数据1：不通过
	Message[0]	=	0x34;
	Message[1]	=	0xb9;
	Message[2]	=	0x03;
	Message[3]	=	0x4c;
	Message[4]	=	0xf9;
	Message[5]	=	0x9c;
	Message[6]	=	0xcf;
	Message[7]	=	0x8e;
	Message[8]	=	0xe7;
	Message[9]	=	0x43;
	Message[10]	=	0xe9;
	Message[11]	=	0xf2;
	Message[12]	=	0x62;
	Message[13]	=	0x8a;
	Message[14]	=	0xc1;
	Message[15]	=	0x8b;
	Message[16]	=	0x32;
	Message[17]	=	0x92;
	Message[18]	=	0x48;
	Message[19]	=	0x46;
	
	//-----------------------------测试数据1:摘要
	Message[0]	=	0xda;
	Message[1]	=	0x31;
	Message[2]	=	0x55;
	Message[3]	=	0x86;
	Message[4]	=	0x0e;
	Message[5]	=	0x90;
	Message[6]	=	0xa3;
	Message[7]	=	0x1f;
	Message[8]	=	0x88;
	Message[9]	=	0xd6;
	Message[10]	=	0xc9;
	Message[11]	=	0xdc;
	Message[12]	=	0x41;
	Message[13]	=	0x6d;
	Message[14]	=	0xd3;
	Message[15]	=	0x1c;
	Message[16]	=	0x4a;
	Message[17]	=	0xd6;
	Message[18]	=	0x59;
	Message[19]	=	0xf6;
	
	//-----------------------------测试数据2:不通过
	Message[0]	=	0x95;
	Message[1]	=	0x79;
	Message[2]	=	0x80;
	Message[3]	=	0x1c;
	Message[4]	=	0x75;
	Message[5]	=	0x80;
	Message[6]	=	0x94;
	Message[7]	=	0x58;
	Message[8]	=	0x41;
	Message[9]	=	0xb1;
	Message[10]	=	0x31;
	Message[11]	=	0x37;
	Message[12]	=	0x96;
	Message[13]	=	0x92;
	Message[14]	=	0x91;
	Message[15]	=	0xdb;
	Message[16]	=	0x34;
	Message[17]	=	0x9d;
	Message[18]	=	0x1d;
	Message[19]	=	0x5a;
	
	//-----------------------------测试数据2:不通过
	//80 58 a6 4d 42 72 3b 4f 7e d1 56 bd 72 c5 4a cc d8 cc 6c 4b
	Message[0]	=	0x80;
	Message[1]	=	0x58;
	Message[2]	=	0xa6;
	Message[3]	=	0x4d;
	Message[4]	=	0x42;
	Message[5]	=	0x72;
	Message[6]	=	0x3b;
	Message[7]	=	0x4f;
	Message[8]	=	0x7e;
	Message[9]	=	0xd1;
	Message[10]	=	0x56;
	Message[11]	=	0xbd;
	Message[12]	=	0x72;
	Message[13]	=	0xc5;
	Message[14]	=	0x4a;
	Message[15]	=	0xcc;
	Message[16]	=	0xd8;
	Message[17]	=	0xcc;
	Message[18]	=	0x6c;
	Message[19]	=	0x4b;
	
