quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100.C
	//bq26100_change_message();
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void api_bq26100_set_message2(unsigned char* buffer)
{
	unsigned char i = 0;

	for(i=0;i<20;i++)
	{
		Message[i]=buffer[i];
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void bq26100_change_message(void)
{
	static unsigned char num=0;
	unsigned char i =0;
	unsigned char buffer[20]={0};
	memcpy(buffer,Message,20);
	//memset(Message,0xFF,20);
}

//-------------------------------------------------------------------------------


//-----------------------------------------------------------------------------
void key_loop(void)
{
	if (key_key32[0]++ >=0xFFFFFFFF)
	{
		if(key_key32[1]++ >= 0xFFFFFFFF)
		{
			if (key_key32[2]++ >= 0xFFFFFFFF)
			{
				if (key_key32[3]++ >= 0xFFFFFFFF)
				{

				}
			}

		}
	}
	/*Ws[0] = Key[0x0C] + Key[0x0D] * 0x0100 + Key[0x0E] * 0x010000 + Key[0x0F] * 0x01000000;
	Ws[1] = Key[0x08] + Key[0x09] * 0x0100 + Key[0x0A] * 0x010000 + Key[0x0B] * 0x01000000;
	Ws[2] = Key[0x04] + Key[0x05] * 0x0100 + Key[0x06] * 0x010000 + Key[0x07] * 0x01000000;
	Ws[3] = Key[0x00] + Key[0x01] * 0x0100 + Key[0x02] * 0x010000 + Key[0x03] * 0x01000000;*/
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100_test_example_getkey(void)
{
	static char flag=0;
	int i;			//Used for doing two times the SHA1 as required by the bq26100
	int t;			//Used for the indexes 0 through 79
	u32 temp;		//Used as the temp variable during the loop in which the working
							//variables A, B, C, D and E are updated
	if(flag!=0)
		return 1;
	key_loop();
	// The 20 bytes of random message that are given to the bq26100 are arranged in 32-bit words
	// so that the microcontroller can compute the SHA1/HMAC
//	Random[0] = key_message[4];
//	Random[1] = key_message[3];
//	Random[2] = key_message[2];
//	Random[3] = key_message[1];
//	Random[4] = key_message[0];
	// The SHA1 is computed two times so that it complies with the bq26100 specification
	for (i=0; i<=1; i++)	//转换两次
	{
		//-------------------加载密钥
		// Work Schedule
		// The first four Working schedule variables Ws[0-3], are based on the key that is 
		// implied that the bq26100 contains.
		Ws[0] = key_key32[3];
		Ws[1] = key_key32[2];
		Ws[2] = key_key32[1];
		Ws[3] = key_key32[0];
		//-------------------第一次转换加载消息，第二将转换加载第一次转换的消息摘要
		// On the first run of the SHA1 the random message is used 		
		if (i==0)
		{
			Ws[4] = key_message[0];
			Ws[5] = key_message[1];
			Ws[6] = key_message[2];
			Ws[7] = key_message[3];
			Ws[8] = key_message[4];
		}
		// On the second run of the SHA1, H(Kd || M) is used		
		else
		{
			Ws[4] = H[0];
			Ws[5] = H[1];
			Ws[6] = H[2];
			Ws[7] = H[3];
			Ws[8] = H[4];
		}
		//-------------------补位操作:
		//Sha-1算法标准规定，必须对消息摘要进行补位操作，即将输入的数据进行填充，使得数据长度对512求余的结果为448，
		//填充比特位的最高位补一个1，其余的位补0，如果在补位之前已经满足对512取模余数为448，也要进行补位，在其后补一位1即可。总之，补位是至少补一位，最多补512位
		// The Work schedule variables Ws[9-15] remain the same regardless of which run of the SHA1.
		// These values are as required by bq26100.	//以下为按照bq26100规定的数值
		Ws[9]	= 0x80000000;		//输入消息长度对512取模余数结果非448(512-64)
		Ws[10] = 0x00000000;
		Ws[11] = 0x00000000;
		Ws[12] = 0x00000000;
		Ws[13] = 0x00000000;
		//--------------------附加信息长度(64位):表示消息摘要的字节数，
		Ws[14] = 0x00000000;
		Ws[15] = 0x00000120;		//总共长度为0x0120(288=160+128)密钥和消息的长度
		
		//--------------------补充混合数据
		// The Work schedule variables Ws[16-79] are determined by the W(t) function	
		for (t = 16; t <= 79; t++)
			Ws[t]=W(t);
		//--------------------初始化缓存
		//一个160位MD缓冲区用以保存中间和最终散列函数的结果。它可以表示为5个32位的寄存器(H0,H1,H2,H3,H4)。初始化为：
		// Working Variables, always start the same	regardless of which SHA1 run
		A = 0x67452301;
		B = 0xefcdab89;
		C = 0x98badcfe;
		D = 0x10325476;
		E = 0xc3d2e1f0;
		// Hash Values, always start the same regardless of what SHA1 run
		H[0] = A;
		H[1] = B;
		H[2] = C;
		H[3] = D;
		H[4] = E;
		//---------------------循环转换数据
		// Loop to change working variables A, B, C, D and E
		// This is defined by FIPS 180-2 document
		for (t = 0; t <= 79; t++)
		{
				temp = Rotl(A,5) + f(B,C,D,t) + E + K(t) + Ws[t];
				E = D;
				D = C;
				C = Rotl(B,30);
				B = A;
				A = temp;
		}
		//----------------------转换出验证结果:转换再次，第一次结果参当作第二次转换的数据
		// 160-Bit SHA-1 Digest
		H[0] = A + H[0];
		H[1] = B + H[1];
		H[2] = C + H[2];
		H[3] = D + H[3];
		H[4] = E + H[4];
	}//End of for loop
	
	if ((key_digest[0] == H[0]) && (key_digest[1] == H[1]) && (key_digest[2] == H[2]) && (key_digest[3] == H[3]))
	{
		flag	=	1;
		return 1;//------------------------验证通过
	}
	return 1;
}
/*******************************************************************************
*函数名			:	get_up_E
*功能描述		:	获取E值
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned long bq26100_get_E(unsigned long* ARRY)
{
	unsigned long temp=0;
	
	return temp;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned long api_bq26100_test_example_getkey2(unsigned long* H1,unsigned long* ARRY)
{
	//ARRY[0]=A,ARRY[1]=B,ARRY[2]=C,ARRY[3]=D,ARRY[4]=E,
	static unsigned char num=80;
	static unsigned char t=0;
	static unsigned long A1,B1,C1,D1,E1;
	unsigned long temp=0;
	if(num==0)
		return 0;
	//----------------导入最终结果数据:求出第80次转换的ABCDE结果
	if(80==num)
	{
		//-----计算A
		if(H1[0]>=0x67452301)
			ARRY[0]=H1[0]-0x67452301;
		else
			ARRY[0]=H1[0]+(0xFFFFFFFF-0x67452301)+1;
		//-----计算B
		if(H1[1]>=0xefcdab89)
			ARRY[1]=H1[1]-0xefcdab89;
		else
			ARRY[1]=H1[1]+(0xFFFFFFFF-0xefcdab89)+1;
		//-----计算C
		if(H1[2]>=0x98badcfe)
			ARRY[2]=H1[2]-0x98badcfe;
		else
			ARRY[2]=H1[2]+(0xFFFFFFFF-0x98badcfe)+1;
		//-----计算D
		if(H1[3]>=0x10325476)
			ARRY[3]=H1[3]-0x10325476;
		else
			ARRY[3]=H1[3]+(0xFFFFFFFF-0x10325476)+1;
		//-----计算E
		if(H1[4]>=0xc3d2e1f0)
			ARRY[4]=H1[4]-0xc3d2e1f0;
		else
			ARRY[4]=H1[4]+(0xFFFFFFFF-0xc3d2e1f0)+1;
						//0x2	0xE
		num--;
		return 0;
	}
	//=====往前推算
	//求上一次的A值:此次的B值
	ARRY[0]=ARRY[1];
	//求上一次的B值:此次的C值反移动
	ARRY[1]=rRotl(ARRY[2],30);
	//求上一次的C值:此次的D值
	ARRY[2]=ARRY[3];
	//求上一次的D值:此次的E值
	ARRY[3]=ARRY[4];
	//求上一次的E值:通过已经ABCD计算
	ARRY[4]=bq26100_get_E(ARRY);
	
