quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100.C
	num--;
//	ARRY[0]=Rotl(H[0], num);
//	if(num<32)
//		num++;
	return temp;
}
/**********************************************************************/
/* 	int main(void)					      							  */
/*																      */
/*	Description : 		This is the main function. It calls the SDQ	  */
/*				  		communication and the SHA1 function. Results  */
/*						are displayed through LEDs.					  */
/* 	Arguments : 		*Value - generic variable for read functions  */
/*						i - used for repeat loops				      */
/*	Global Variables:	Message[], Key[], Digest[], Digest_32[]		  */
/*  Returns: 			None								          */
/**********************************************************************/
void api_bq26100_test_example(void)
{
	//-------------流程：
	//1,生成随机消息
	//2,将数据与key一起计算出结果
	//3,将消息发往bq26100
	//4,设置发送bq26100控制命令
	//5,读取bq26100的验证结果
	//6,对比第二步计算出的结果与从bq26100读取的数据,如果相同，验证通过
	unsigned char Value;
	int i;
	static unsigned char flag=0;
  sdq_result result;
	if(flag++>=5)
	{
		flag	=	0;
		//bq26100_reg_addr++;
	}
	//--------------------设置密钥
	bq26100_set_key();	
	
	//--------------------生成随机数消息
	srand(0);
	for (i=0; i<=19; i++)
	{
		Message[i] = rand()%256;		//获取随机数
	}
	
	
	//--------------------按照BQ26100的要求计算SHA1/HMAC
	api_bq26100_step1_Auth();	
	
	bq26100_set_message();		//测试实际数据
	
	//--------------------发送消息
	result	=	api_bq26100_step2_send_message(Message,20);
	if(result	==	sdq_error)
		return ;
	//--------------------
	result	=	api_bq26100_step3_write_control();
	//api_bq26100_step4_read_control();
	
	if(result	==	sdq_error)
		return ;
	//--------------------读取bq26100生成的SHA1/HMAC并对比
	result	=	api_bq26100_step5_read_digest();
}
/**********************************************************************/
/* 	int main(void)					      							  */
/*																      */
/*	Description : 		This is the main function. It calls the SDQ	  */
/*				  		communication and the SHA1 function. Results  */
/*						are displayed through LEDs.					  */
/* 	Arguments : 		*Value - generic variable for read functions  */
/*						i - used for repeat loops				      */
/*	Global Variables:	Message[], Key[], Digest[], Digest_32[]		  */
/*  Returns: 			None								          */
/**********************************************************************/
void api_bq26100_test_example22(unsigned long* buffer)
{
	#include "usb_data.h"
	//-------------流程：
	//1,生成随机消息
	//2,将数据与key一起计算出结果
	//3,将消息发往bq26100
	//4,设置发送bq26100控制命令
	//5,读取bq26100的验证结果
	//6,对比第二步计算出的结果与从bq26100读取的数据,如果相同，验证通过
	unsigned char Value;
	int i;
	static unsigned char flag=0;
  sdq_result result;
//	if(flag++>=5)
//	{
//		flag	=	0;
//		//bq26100_reg_addr++;
//	}
//	//--------------------设置密钥
//	bq26100_set_key();	
//	
//	//--------------------生成随机数消息
//	srand(0);
//	for (i=0; i<=19; i++)
//	{
//		Message[i] = rand()%256;		//获取随机数
//	}
//	
//	
//	//--------------------按照BQ26100的要求计算SHA1/HMAC
//	api_bq26100_step1_Auth();	
	
//	bq26100_set_message();		//测试实际数据
	
	//--------------------发送消息
	result	=	api_bq26100_step2_send_message(Message,20);
	if(result	==	sdq_error)
		return ;
	//--------------------
	result	=	api_bq26100_step3_write_control();
	//api_bq26100_step4_read_control();
	
	if(result	==	sdq_error)
		return ;
	//--------------------读取bq26100生成的SHA1/HMAC并对比
	result	=	api_bq26100_step5_read_digest();
	
	api_usb_in_set_data(Digest,20);
	
	for(i=0;i<5;i++)
	{
		buffer[i]=Digest_32[i];
	}
}

/**********************************************************************/
/* 	int main(void)					      							  */
/*																      */
/*	Description : 		This is the main function. It calls the SDQ	  */
/*				  		communication and the SHA1 function. Results  */
/*						are displayed through LEDs.					  */
/* 	Arguments : 		*Value - generic variable for read functions  */
/*						i - used for repeat loops				      */
/*	Global Variables:	Message[], Key[], Digest[], Digest_32[]		  */
/*  Returns: 			None								          */
/**********************************************************************/
unsigned char api_bq26100_data_Verify(unsigned char* message,unsigned char* digest,unsigned long serial)
{
	#include "usb_data.h"
	//-------------流程：
	//1,生成随机消息
	//2,将数据与key一起计算出结果
	//3,将消息发往bq26100
	//4,设置发送bq26100控制命令
	//5,读取bq26100的验证结果
	//6,对比第二步计算出的结果与从bq26100读取的数据,如果相同，验证通过
	unsigned char Value;
	int i;
	static unsigned char flag=0;
  sdq_result result;

	memcpy(Message,bq26100_sample_data[serial][0],20);
	
	//--------------------发送消息
	result	=	api_bq26100_step2_send_message(Message,20);
	if(result	==	sdq_error)
		return 0;
	//--------------------
	result	=	api_bq26100_step3_write_control();
	//api_bq26100_step4_read_control();
	
	if(result	==	sdq_error)
		return 0;
	//--------------------读取bq26100生成的SHA1/HMAC并对比
	result	=	api_bq26100_step5_read_digest();
	
	//---------------------与原消息摘要对比
	if(0==memcmp(Digest,bq26100_sample_data[serial][1],20))
	{
		message	=	(unsigned char*)bq26100_sample_data[serial][0];
		digest	=	(unsigned char*)bq26100_sample_data[serial][1];
		return 1;
	}

	return 0;
}
/**********************************************************************/
/* 	int main(void)					      							  */
/*																      */
/*	Description : 		This is the main function. It calls the SDQ	  */
/*				  		communication and the SHA1 function. Results  */
/*						are displayed through LEDs.					  */
/* 	Arguments : 		*Value - generic variable for read functions  */
/*						i - used for repeat loops				      */
/*	Global Variables:	Message[], Key[], Digest[], Digest_32[]		  */
/*  Returns: 			None								          */
/**********************************************************************/
unsigned char api_bq26100_Get_Digest(unsigned char* message,unsigned char* digest,unsigned long serial)
{
	#include "usb_data.h"
	//-------------流程：
	//1,生成随机消息
	//2,将数据与key一起计算出结果
	//3,将消息发往bq26100
	//4,设置发送bq26100控制命令
	//5,读取bq26100的验证结果
	//6,对比第二步计算出的结果与从bq26100读取的数据,如果相同，验证通过
	unsigned char Value;
	int i;
	static unsigned char flag=0;
  sdq_result result;

	memcpy(Message,bq26100_sample_data[serial][0],20);
	
	//--------------------发送消息
	result	=	api_bq26100_step2_send_message(Message,20);
	if(result	==	sdq_error)
		return 0;
	//--------------------
	result	=	api_bq26100_step3_write_control();
	//api_bq26100_step4_read_control();
	
	if(result	==	sdq_error)
		return 0;
	//--------------------读取bq26100生成的SHA1/HMAC并对比
	result	=	api_bq26100_step5_read_digest();
	
	//---------------------返回数据地址	
	message	=	(unsigned char*)bq26100_sample_data[serial][0];
	digest	=	(unsigned char*)Digest;


	return 1;
}
//-------------------------------------------------------------------------------





/**********************************************************************/
/* 	void Auth(void)					      							  */
/*																      */
/*	Description : 		This procedure computes the SHA1/HMAC as 	  */
/*				  		required by the bq26100						  */
/* 	Arguments : 		i - times that SHA1 is executing			  */
/*						t - index 0 through 79						  */
/*     					temp - Used to update working variables		  */
/*	Global Variables:	Random[], Message[], Key[], Ws[], H[],		  */
/*						A, B, C, D, E								  */
/*  Returns: 			Result of 32-bit word rotated n times         */
/**********************************************************************/ 
void Auth(void)
{
	int i;			//Used for doing two times the SHA1 as required by the bq26100
	int t;			//Used for the indexes 0 through 79
	u32 temp;		//Used as the temp variable during the loop in which the working
					//variables A, B, C, D and E are updated
	
