quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100.C
// The 20 bytes of random message that are given to the bq26100 are arranged in 32-bit words
// so that the microcontroller can compute the SHA1/HMAC
	Random[0] = Message[0x10] + Message[0x11]*0x0100 + Message[0x12]*0x010000 + Message[0x13]*0x01000000;
	Random[1] = Message[0x0C] + Message[0x0D]*0x0100 + Message[0x0E]*0x010000 + Message[0x0F]*0x01000000;
	Random[2] = Message[0x08] + Message[0x09]*0x0100 + Message[0x0A]*0x010000 + Message[0x0B]*0x01000000;
	Random[3] = Message[0x04] + Message[0x05]*0x0100 + Message[0x06]*0x010000 + Message[0x07]*0x01000000;
	Random[4] = Message[0x00] + Message[0x01]*0x0100 + Message[0x02]*0x010000 + Message[0x03]*0x01000000;
// The SHA1 is computed two times so that it complies with the bq26100 specification
	for (i=0; i<=1; i++)
	{
//Work Schedule
	// The first four Working schedule variables Ws[0-3], are based on the key that is 
	// implied that the bq26100 contains.
		Ws[0] = Key[0x0C] + Key[0x0D]*0x0100 + Key[0x0E]*0x010000 + Key[0x0F]*0x01000000;
		Ws[1] = Key[0x08] + Key[0x09]*0x0100 + Key[0x0A]*0x010000 + Key[0x0B]*0x01000000;
		Ws[2] = Key[0x04] + Key[0x05]*0x0100 + Key[0x06]*0x010000 + Key[0x07]*0x01000000;
		Ws[3] = Key[0x00] + Key[0x01]*0x0100 + Key[0x02]*0x010000 + Key[0x03]*0x01000000;
// On the first run of the SHA1 the random message is used 		
		if (i==0)
		{
			Ws[4] = Random[0];
			Ws[5] = Random[1];
			Ws[6] = Random[2];
			Ws[7] = Random[3];
			Ws[8] = Random[4];
		}
// On the second run of the SHA1, H(Kd || M) is used		
		else
		{
			Ws[4] = H[0];
			Ws[5] = H[1];
			Ws[6] = H[2];
			Ws[7] = H[3];
			Ws[8] = H[4];
		}
// The Work schedule variables Ws[9-15] remain the same regardless of which run of the SHA1.
// These values are as required by bq26100.
		Ws[9] = 0x80000000;
		Ws[10] = 0x00000000;
		Ws[11] = 0x00000000;
		Ws[12] = 0x00000000;
		Ws[13] = 0x00000000;
		Ws[14] = 0x00000000;
		Ws[15] = 0x00000120;

// The Work schedule variables Ws[16-79] are determined by the W(t) function	
		for (t = 16; t <= 79; t++)
			Ws[t]=W(t);
// Working Variables, always start the same	regardless of which SHA1 run
		A = 0x67452301;
		B = 0xefcdab89;
		C = 0x98badcfe;
		D = 0x10325476;
		E = 0xc3d2e1f0;
// Hash Values, always start the same regardless of what SHA1 run
		H[0] = A;
		H[1] = B;
		H[2] = C;
		H[3] = D;
		H[4] = E;
// Loop to change working variables A, B, C, D and E
// This is defined by FIPS 180-2 document
		for (t = 0; t <= 79; t++)
	{
			temp = Rotl(A,5) + f(B,C,D,t) + E + K(t) + Ws[t];
			E = D;
			D = C;
			C = Rotl(B,30);
			B = A;
			A = temp;
	}
// 160-Bit SHA-1 Digest
		H[0] = A + H[0];
		H[1] = B + H[1];
		H[2] = C + H[2];
		H[3] = D + H[3];
		H[4] = E + H[4];
	}//End of for loop
}	//End Auth() function
//-----------------------------------------------------------------------------






/**********************************************************************/
/* 	int main(void)					      							  */
/*																      */
/*	Description : 		This is the main function. It calls the SDQ	  */
/*				  		communication and the SHA1 function. Results  */
/*						are displayed through LEDs.					  */
/* 	Arguments : 		*Value - generic variable for read functions  */
/*						i - used for repeat loops				      */
/*	Global Variables:	Message[], Key[], Digest[], Digest_32[]		  */
/*  Returns: 			None								          */
/**********************************************************************/
void api_bq26100_test_examplebac(void)
{
	unsigned char Value;
	unsigned long i;
  	
// Select the key to be used here. In this example 0x3601FCFB12B87356C1548630FD3EA0D2 is used.  
	Key[0] = 0xD2;
	Key[1] = 0xA0;
	Key[2] = 0x3E;
	Key[3] = 0xFD;
	Key[4] = 0x30;
	Key[5] = 0x86;
	Key[6] = 0x54;
	Key[7] = 0xC1;
	Key[8] = 0x56;
	Key[9] = 0x73;
	Key[10] = 0xB8;
	Key[11] = 0x12;
	Key[12] = 0xFB;
	Key[13] = 0xFC;
	Key[14] = 0x01;
	Key[15] = 0x36;
	
	
/*	for (i=0; i<=15; i++){
  		Key[i] = 0x00;
  	}
*/ 
// Create a random message generator and insert here. In this example the message is fixed. 	
//	srand(0);
//	for (i=0; i<=19; i++)
//	{
//		Message[i] = rand()%256;		//获取随机数
//	}
	bq26100_set_message();	//生成消息
	Auth();	 		//Perform SHA1 authentication through host
   	
//// Initialize Port 9.3 for SDQ communication
//  	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_3;
//  	GPIO_InitStruct.GPIO_Direction = GPIO_PinOutput;
//  	GPIO_InitStruct.GPIO_Type = GPIO_Type_PushPull;
//  	GPIO_InitStruct.GPIO_IPConnected = GPIO_IPConnected_Disable;
//  	GPIO_InitStruct.GPIO_Alternate = GPIO_OutputAlt1;
//  	GPIO_Init(GPIO9, &GPIO_InitStruct);

//// Initilaize ports 8.0 and 8.6 for LED driving
//  	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_All;
//  	GPIO_InitStruct.GPIO_Direction = GPIO_PinOutput;
//  	GPIO_InitStruct.GPIO_Type = GPIO_Type_PushPull;
//  	GPIO_InitStruct.GPIO_IPConnected = GPIO_IPConnected_Disable;
//  	GPIO_InitStruct.GPIO_Alternate = GPIO_OutputAlt1;
//  	GPIO_Init(GPIO8, &GPIO_InitStruct);

//  	GPIO_Write(GPIO8, 0x00);	//Ensure that all ports of GPIO 8 are low,
//							  	//given that they are connected to LCD and do not want
//							  	//disturb it.

  
	// Send 160-bit Message to bq26100
	bq26100_rest();	   			
//	*Value = TestPresence(); 		//Determine if there is a SDQ compatible device connected
//	if (*Value==0x00)	//No device connected or functional
//	{	
//		//GPIO_WriteBit(GPIO8, GPIO_Pin_0, Bit_RESET);
//		while (1)	//Blink red LED at a 0.5 sec on and 0.5 sec off rate
//		{				 		
////			GPIO_WriteBit(GPIO8, GPIO_Pin_6, Bit_RESET);  	//Red LED off
////			wait_us(1e6/2);  					  			//wait approximately 0.5 seconds
////			GPIO_WriteBit(GPIO8, GPIO_Pin_6, Bit_SET); 	  	//Red LED on
////			wait_us(1e6/2);									//wait approximately 0.5 seconds
//		}
//	}
	// Skip ROM Command
	sdq_write_byte(0xCC);
	// Write Message Command
	sdq_write_byte(0x22);	//Write Message Command
	// Write Address
	sdq_write_byte(0x00);	//Address Low Byte
	sdq_write_byte(0x00);	//Address High Byte
	// Write first byte of message, Message[0]
	sdq_write_byte(Message[0x00]);	
	Value = sdq_read_byte();	//Read CRC of Message Command, Address and Data
	//CRC are not being calculated by the microcontroller, the results given by
	//bq26100 are being ignored
	// Read Data to Verify Write
	Value = sdq_read_byte();
	// Write the remaining bytes of the message
	for (i=1; i<=19; i++)
	{
		sdq_write_byte(Message[i]);
		Value = sdq_read_byte();		//Read CRC
		Value = sdq_read_byte();		//Read Data
		
		
