quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100.C
	}


	// Write Control to set AUTH bit to initiate Authentication by bq26100
	bq26100_rest();
	Value = TestPresence();
	// Skip ROM Command
	sdq_write_byte(0xCC);
	// Write Control Command
	sdq_write_byte(0x77);	//Write Control Command
	// Write Address
	sdq_write_byte(0x00);	//Address Low Byte
	sdq_write_byte(0x00);	//Address High Byte
	// Write Auth Bit of Control Register
	sdq_write_byte(0x01);	
	Value = sdq_read_byte();	//Read CRC of Write Control Command, Address and Data
	// Read Data to Verify Write
	Value = sdq_read_byte();

	
	//Read Digest
	bq26100_rest();
	Value = TestPresence();
	// Skip ROM Command
	sdq_write_byte(0xCC);
	// Read Digest Command
	sdq_write_byte(0xDD);	//Read Digest Command
	// Write Address
	sdq_write_byte(0x00);	//Address Low Byte
	sdq_write_byte(0x00);	//Address High Byte
	Value = sdq_read_byte();	//Read CRC of Read Digest Command, Address
	// Read Digest
	for (i=0; i<=19; i++)
	{
		Digest[i] = sdq_read_byte();
	}
	// Read CRC of Digest
	Value = sdq_read_byte();

	// The 20 bytes of the digest returned by the bq26100 is arranged in 32-bit words so that it
	// can be compared with the results computed by the microcontroller
	Digest_32[4] = Digest[0x00] + Digest[0x01]*0x0100 + Digest[0x02]*0x010000 + Digest[0x03]*0x01000000;
	Digest_32[3] = Digest[0x04] + Digest[0x05]*0x0100 + Digest[0x06]*0x010000 + Digest[0x07]*0x01000000;
	Digest_32[2] = Digest[0x08] + Digest[0x09]*0x0100 + Digest[0x0A]*0x010000 + Digest[0x0B]*0x01000000;
	Digest_32[1] = Digest[0x0C] + Digest[0x0D]*0x0100 + Digest[0x0E]*0x010000 + Digest[0x0F]*0x01000000;
	Digest_32[0] = Digest[0x10] + Digest[0x11]*0x0100 + Digest[0x12]*0x010000 + Digest[0x13]*0x01000000;

	// The results given by microcontroller and bq26100 are compared
	if (Digest_32[0] == H[0])
	{
		if (Digest_32[1] == H[1])
		{
			if (Digest_32[2] == H[2])
			{
				if (Digest_32[3] == H[3])
				{
					if (Digest_32[4] == H[4])
					{ 	//If all values are same then Authentication is successful
						//GPIO_WriteBit(GPIO8, GPIO_Pin_0, Bit_SET);		//LED Green on
						//GPIO_WriteBit(GPIO8, GPIO_Pin_6, Bit_RESET); 	//LED Red off
					}
					else
					{						//If any of the values do not match then authentication fails
						//GPIO_WriteBit(GPIO8, GPIO_Pin_6, Bit_SET); 		//LED Red on
						//GPIO_WriteBit(GPIO8, GPIO_Pin_0, Bit_RESET); 	//LED Green off
					}
				}
				else
				{
					//GPIO_WriteBit(GPIO8, GPIO_Pin_6, Bit_SET); 			//LED Red on
					//GPIO_WriteBit(GPIO8, GPIO_Pin_0, Bit_RESET);		//LED Green off
				}
			}			
			else
			{
				//GPIO_WriteBit(GPIO8, GPIO_Pin_6, Bit_SET); 				//LED Red on
				//GPIO_WriteBit(GPIO8, GPIO_Pin_0, Bit_RESET);			//LED Green off	
			}
		}
		else
		{
			//GPIO_WriteBit(GPIO8, GPIO_Pin_6, Bit_SET); 					//LED Red on
			//GPIO_WriteBit(GPIO8, GPIO_Pin_0, Bit_RESET);				//LED Green off
		}
	}
	else
	{
		//GPIO_WriteBit(GPIO8, GPIO_Pin_6, Bit_SET); 						//LED Red on
		//GPIO_WriteBit(GPIO8, GPIO_Pin_0, Bit_RESET);					//LED Green off
	}  
}













//------------------------------------------------------------------------------


/*******************************************************************************
* 函数名			:	function
* 功能描述		:	初始化Dallas的IO口 DQ 同时检测DS的存在
* 输入			: void
* 返回值			: 返回1:不存在
							返回0:存在
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
sdq_result BQ26100_Init(void)
{
	sdq_result Result	=	sdq_error;
	GPIO_Configuration_OPP50	(SDQ_Port,	SDQ_Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605

//	Result	=	Dallas_Rest();

	return Result;
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	从Dallas器件Rom读出ID值
* 输入			: void
* 返回值			: 开始8位是单线产品系列代码，接着48位是唯一序列号，最后8位是前56位的CRC值
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
sdq_result BQ26100_GetID(unsigned char *pBuf)
{
	unsigned char i;
	unsigned char buf[8];

//	Dallas_Rest();						//复位总线

//	Dallas_WriteByte(0x33);		//read romid
//	for(i=0; i<8; i++)
//		buf[i] = Dallas_ReadByte();
//	
//	if(buf[0] != 0x01)
//		return 1;
//	if(CRC8_Calculate(buf, 7) != buf[7])
//		return 1;

//	for(i=0; i<8; i++)
//		pBuf[i] = buf[i];
	
	return sdq_error;
}









































//#ifdef USE_DALLAS
//const uint8_t g_CRC8Tab[256]=
//{
//0x00, 0x5e, 0xbc, 0xe2, 0x61, 0x3f, 0xdd, 0x83, 0xc2, 0x9c, 0x7e, 0x20, 0xa3, 0xfd, 0x1f, 0x41,
//0x9d, 0xc3, 0x21, 0x7f, 0xfc, 0xa2, 0x40, 0x1e, 0x5f, 0x01, 0xe3, 0xbd, 0x3e, 0x60, 0x82, 0xdc,
//0x23, 0x7d, 0x9f, 0xc1, 0x42, 0x1c, 0xfe, 0xa0, 0xe1, 0xbf, 0x5d, 0x03, 0x80, 0xde, 0x3c, 0x62,
//0xbe, 0xe0, 0x02, 0x5c, 0xdf, 0x81, 0x63, 0x3d, 0x7c, 0x22, 0xc0, 0x9e, 0x1d, 0x43, 0xa1, 0xff,
//0x46, 0x18, 0xfa, 0xa4, 0x27, 0x79, 0x9b, 0xc5, 0x84, 0xda, 0x38, 0x66, 0xe5, 0xbb, 0x59, 0x07,
//0xdb, 0x85, 0x67, 0x39, 0xba, 0xe4, 0x06, 0x58, 0x19, 0x47, 0xa5, 0xfb, 0x78, 0x26, 0xc4, 0x9a,
//0x65, 0x3b, 0xd9, 0x87, 0x04, 0x5a, 0xb8, 0xe6, 0xa7, 0xf9, 0x1b, 0x45, 0xc6, 0x98, 0x7a, 0x24,
//0xf8, 0xa6, 0x44, 0x1a, 0x99, 0xc7, 0x25, 0x7b, 0x3a, 0x64, 0x86, 0xd8, 0x5b, 0x05, 0xe7, 0xb9,
//0x8c, 0xd2, 0x30, 0x6e, 0xed, 0xb3, 0x51, 0x0f, 0x4e, 0x10, 0xf2, 0xac, 0x2f, 0x71, 0x93, 0xcd,
//0x11, 0x4f, 0xad, 0xf3, 0x70, 0x2e, 0xcc, 0x92, 0xd3, 0x8d, 0x6f, 0x31, 0xb2, 0xec, 0x0e, 0x50,
//0xaf, 0xf1, 0x13, 0x4d, 0xce, 0x90, 0x72, 0x2c, 0x6d, 0x33, 0xd1, 0x8f, 0x0c, 0x52, 0xb0, 0xee,
//0x32, 0x6c, 0x8e, 0xd0, 0x53, 0x0d, 0xef, 0xb1, 0xf0, 0xae, 0x4c, 0x12, 0x91, 0xcf, 0x2d, 0x73,
//0xca, 0x94, 0x76, 0x28, 0xab, 0xf5, 0x17, 0x49, 0x08, 0x56, 0xb4, 0xea, 0x69, 0x37, 0xd5, 0x8b,
//0x57, 0x09, 0xeb, 0xb5, 0x36, 0x68, 0x8a, 0xd4, 0x95, 0xcb, 0x29, 0x77, 0xf4, 0xaa, 0x48, 0x16,
//0xe9, 0xb7, 0x55, 0x0b, 0x88, 0xd6, 0x34, 0x6a, 0x2b, 0x75, 0x97, 0xc9, 0x4a, 0x14, 0xf6, 0xa8,
//0x74, 0x2a, 0xc8, 0x96, 0x15, 0x4b, 0xa9, 0xf7, 0xb6, 0xe8, 0x0a, 0x54, 0xd7, 0x89, 0x6b, 0x35
//};

////查表计算方法
//uint8_t CRC8_Calculate(uint8_t *pBuf, uint8_t len)
//{
//	uint8_t crc8=0;	//CRC8字节初始化
//	
//	//进行CRC8位校验
//	while(len){
//		crc8 = g_CRC8Tab[*pBuf^crc8];
//		pBuf++;
//		len--;
//	}

//	return(crc8);	//返回CRC8校验数据
//}  

////复位Dallas
//void Dallas_Rst(void)
//{                 
//	DALLAS_IO_OUT();	//SET PG11 OUTPUT
//	DALLAS_OUT_LOW();	//拉低DQ
//	Delay_us(750);		//拉低750us
//	DALLAS_OUT_HIGH();	//DQ=1 
//	Delay_us(15);		//15US
//}

////等待Dallas的回应
////返回1:未检测到Dallas1的存在
////返回0:存在
//uint8_t Dallas_Check(void)
//{
//	uint8_t retry=0;
//	
//	DALLAS_IO_IN();		//SET PG11 INPUT	 
//	while(DALLAS_IN_STATE() && (retry < 200)){
//		retry++;
//		Delay_us(1);
//	} 
//	if(retry >= 200)
//		return 1;
//	else
//		retry=0;
//	while((!DALLAS_IN_STATE()) && (retry < 240)){
//		retry++;
//		Delay_us(1);
//	}
//	if(retry >= 240)
//		return 1;
//	
//	return 0;
//}

