quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100.C
////从Dallas读取一个位
////返回值：1/0
//uint8_t Dallas_ReadBit(void)
//{
//	uint8_t data;
//	
//	DALLAS_IO_OUT();	//SET PG11 OUTPUT
//	DALLAS_OUT_LOW(); 
//	Delay_us(2);
//	DALLAS_OUT_HIGH(); 
//	DALLAS_IO_IN();		//SET PG11 INPUT
//	Delay_us(12);
//	if(DALLAS_IN_STATE())
//		data = 1;
//	else
//		data = 0;	 
//	Delay_us(50);
//	
//	return data;
//}

////从Dallas读取一个字节
////返回值：读到的数据
//uint8_t Dallas_ReadByte(void)
//{        
//	uint8_t i,j,dat;
//	
//	dat = 0;
//	for (i=1; i<=8; i++){
//		j = Dallas_ReadBit();
//		dat = (j<<7)|(dat>>1);
//	}
//	
//	return dat;
//}

////写一个字节到Dallas
////dat：要写入的字节
//void Dallas_WriteByte(uint8_t dat)
//{             
//	uint8_t j;
//	uint8_t testb;
//	
//	DALLAS_IO_OUT();	//SET PG11 OUTPUT;
//	for (j=1; j<=8; j++){
//		testb = dat&0x01;
//		dat = dat>>1;
//		if (testb){
//			DALLAS_OUT_LOW();	// Write 1
//			Delay_us(2);
//			DALLAS_OUT_HIGH();
//			Delay_us(60);
//		}else{
//			DALLAS_OUT_LOW();	// Write 0
//			Delay_us(60);
//			DALLAS_OUT_HIGH();
//			Delay_us(2);
//		}
//	}
//}

////初始化Dallas的IO口 DQ 同时检测DS的存在
////返回1:不存在
////返回0:存在    	 
//uint8_t Dallas_Init(void)
//{
//	GPIO_InitTypeDef  GPIO_InitStructure;

//	GPIO_SetBits(DALLAS_GPIOx, DALLAS_PIN);
//	GPIO_InitStructure.GPIO_Pin = DALLAS_PIN;
//	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP; 		  
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//	GPIO_Init(DALLAS_GPIOx, &GPIO_InitStructure);

//	Dallas_Rst();

//	return Dallas_Check();
//}

////从Dallas器件Rom读出ID值
////数据：开始8位是单线产品系列代码，接着48位是唯一序列号，最后8位是前56位的CRC值
//uint8_t Dallas_GetID(uint8_t *pBuf)
//{
//	uint8_t i;
//	uint8_t buf[8];

//	Dallas_Rst();	
//	if(Dallas_Check())
//		return 1;
//	Dallas_WriteByte(0x33);	//read romid
//	for(i=0; i<8; i++)
//		buf[i] = Dallas_ReadByte();
//	
//	if(buf[0] != 0x01)
//		return 1;
//	if(CRC8_Calculate(buf, 7) != buf[7])
//		return 1;

//	for(i=0; i<8; i++)
//		pBuf[i] = buf[i];
//	
//	return 0;
//}
//#endif

